/*
 * Напиши скрипт, який розрахує ставку податку від доходу.
 * Ставка податку залежить від розміру твого доходу:
 * якщо дохід до 1000 грн. включно — податок 2%;
 * якщо дохід від 1000 грн. до 10000 грн. включно — податок 3%;
 * якщо дохід більший за 10000 грн — податок 5%;
 */

const income = 10000;
let result = 0;

if (income <= 1000) {
  result = income * 0.02;
} else if (income > 1000 && income <= 10000) {
  result = income * 0.03;
} else if (income > 10000) {
  result = income * 0.05;
}

console.log(result);
