// todo Введення користувача та розгалуження
/*
 * Напиши скрипт, який питатиме логін за допомогою prompt і логуватиме результат у консоль браузера.

* Якщо відвідувач вводить "Адмін", то prompt запитує пароль

* Якщо нічого не введено або натиснута клавіша Esc - вивести рядок "Скасовано"

* В іншому випадку вивести рядок "Я вас не знаю"
* Пароль перевіряти так:

* Якщо введено пароль "Я адмін", то вивести рядок "Вітаю!!"
* Інакше виводити рядок "Невірний пароль"
*/

// const USER_LOGIN = 'Адмін';
// const USER_PASSWORD = 'Я адмін';

// let inputLogin = prompt('Введіть свій логін');

// if (inputLogin === USER_LOGIN) {
//   let inputPassword = prompt('Введіть свій пароль');

//   const result =
//     inputPassword === USER_PASSWORD ? 'Вітаю!!' : 'Невірний пароль';

//   console.log(result);
// } else if (inputLogin === null || inputLogin === '') {
//   console.log('Скасовано');
// } else {
//   console.log('Я вас не знаю');
// }
