// todo

/*
 * Напиши скрипт, який просить відвідувача ввести число у prompt до тих пір, поки відвідувач натисне Cancel та щоразу додає введене значення до загальної суми.
 * При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення додається до значення змінної total.
 * Операція введення числа триває доти, доки користувач не натисне кнопку Cancel у prompt.
 * Після того, як користувач припинив введення, натиснувши кнопку Cancel, показати alert з рядком 'Загальна сума чисел дорівнює [сума]'.
 * Робити перевірку того, що користувач ввів саме число, а не довільний набір символів, не потрібно.
 * Якщо хочеш, у разі некоректного введення, показуй alert з текстом 'Було введено не число, спробуйте ще раз', при цьому результат prompt плюсувати до загальної суми не потрібно, після чого користувачеві знову пропонується ввести число в prompt.
 */

// let input;
// let total = 0;

// while (true) {
//   input = prompt('Введіть число', 0);

//   if (isNaN(Number(input))) {
//     alert('Було введено не число. Спробуйте ще');
//     continue;
//   }

//   if (input === null) {
//     break;
//   }

//   total += Number(input);
// }

// console.log(`Загальна сума чисел дорівнює ${total}`);
